package com.bpapps.jobimclone.fragments.registarationfragments.termsofuse;

import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.Menu;
import android.view.MenuInflater;
import android.view.MenuItem;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.AppCompatButton;
import androidx.appcompat.widget.Toolbar;
import androidx.fragment.app.Fragment;

import com.bpapps.jobimclone.R;


/**
 * A simple {@link Fragment} subclass.
 */
public class TermsOfUseShowerFragment extends Fragment implements View.OnClickListener {

    public static final String STACK_TAG = "STACK_TAG." + TermsOfUseShowerFragment.class.getName();
    private AppCompatButton mButtonTermOfUse;
    private AppCompatButton mButtonPrivacyPolicy;
    private TextView mTextViewDetails;
    private boolean mCurrChosenTerms = true;


    public TermsOfUseShowerFragment() {
    }

    public static Fragment getInstance() {
        return new TermsOfUseShowerFragment();
    }


    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        View view = inflater.inflate(R.layout.fragment_terms_of_use_shower, container, false);

        setUpToolBar((AppCompatActivity) requireActivity());

        mButtonTermOfUse = view.findViewById(R.id.button_term_of_use);
        mButtonTermOfUse.setOnClickListener(this);

        mButtonPrivacyPolicy = view.findViewById(R.id.button_privacy_policy);
        mButtonPrivacyPolicy.setOnClickListener(this);

        mTextViewDetails = view.findViewById(R.id.text_view_details);
        mTextViewDetails.setText(getTerms());

        return view;
    }

    private void setUpToolBar(AppCompatActivity activity) {
        activity.getSupportActionBar().show();
        Toolbar toolbar = activity.findViewById(R.id.tool_bar);

        TextView title = toolbar.findViewById(R.id.text_view_tool_bar_title);
        title.setText(R.string.tern_of_use_tool_bar_title);
        title.setPadding(200, 0, 0, 0);

        toolbar.findViewById(R.id.image_view_main_nav).setVisibility(View.GONE);

        setHasOptionsMenu(true);
    }

    @Override
    public void onCreateOptionsMenu(@NonNull Menu menu, @NonNull MenuInflater inflater) {
        super.onCreateOptionsMenu(menu, inflater);

        inflater.inflate(R.menu.terms_of_use_screen_menu, menu);
    }

    @Override
    public boolean onOptionsItemSelected(@NonNull MenuItem item) {
        switch (item.getItemId()) {
            case R.id.go_back:
                requireActivity().getSupportFragmentManager().popBackStack();
                return true;
            default:
                return super.onOptionsItemSelected(item);
        }
    }

    @Override
    public void onClick(View v) {
        switch (v.getId()) {
            case R.id.button_term_of_use:
                if (!mCurrChosenTerms) {
                    mButtonTermOfUse.setBackground(getResources().getDrawable(R.drawable.cornered_terms_chosen));
                    mButtonTermOfUse.setTextColor(getResources().getColor(R.color.taped_button_chosen_text_color));

                    mButtonPrivacyPolicy.setBackground(getResources().getDrawable(R.drawable.cornered_taped_button_not_chosen));
                    mButtonPrivacyPolicy.setTextColor(getResources().getColor(R.color.taped_button_not_chosen_text_color));

                    mTextViewDetails.setText(getTerms());

                    mCurrChosenTerms = !mCurrChosenTerms;
                }
                break;
            case R.id.button_privacy_policy:
                if (mCurrChosenTerms) {
                    mButtonTermOfUse.setBackground(getResources().getDrawable(R.drawable.cornered_terms_not_chosen));
                    mButtonTermOfUse.setTextColor(getResources().getColor(R.color.taped_button_not_chosen_text_color));

                    mButtonPrivacyPolicy.setBackground(getResources().getDrawable(R.drawable.cornered_privacy_chosen));
                    mButtonPrivacyPolicy.setTextColor(getResources().getColor(R.color.taped_button_chosen_text_color));

                    mTextViewDetails.setText(getPrivacyPolicy());

                    mCurrChosenTerms = !mCurrChosenTerms;
                }
                break;
        }
    }

    private String getTerms() {
        return "  תנאי שימוש באפליקציה\n" +
                "1.מבוא\n" +
                "⦁\tתנאי השימוש אלו מהווים הסכם בינך לבין ג'וב סיטי בע\"מ (\"המפעילה\"), הבעלים והמפעילה של אפליקציית \"ג'ובים\" (\"האפליקציה\").\n" +
                "⦁\tמסמך זה מנוסח בלשון זכר אולם מיועד לנשים ולגברים כאחד.\n" +
                "⦁\tהמפעילה שומרת לה את הזכות לשנות מעת לעת את הוראות תנאי שימוש זה המפורטות לעיל וכן את תוכן האפליקציה, מבלי שתהיה חייבת להודיע על השינויים כאמור.\n" +
                "⦁\tהנך מסכים, כי השימוש שלך באפליקציה ייעשה אך ורק בכפוף לכל דרישות השימוש אשר ייקבעו מזמן לזמן על ידי המפעילה, ולכללי השימוש אשר נקבעו בחנויות האפליקציות השונות.\n" +
                "2.הסכמה\n" +
                "⦁\tבמסירת המספר טלפון הנייד שלך בעת עשיית השימוש לראשונה באפליקציה, הנך נותן בזאת את הסכמתך לתנאי השימוש ומדיניות הגנת הפרטיות של האפליקציה.\n" +
                "⦁\tאנא קרא את תנאי השימוש בקפידה, שכן הם מהווים הסכם מחייב בינך לבין המפעילה. אם אינך מסכים לתנאי שימוש אלו, אזי אל תעשה שימוש באפליקציה ו/או מחק את האפליקציה מהטלפון הנייד שלך. השימוש שלך באפליקציה יהיה כפוף באופן מוחלט לתנאי שימוש אלו.\n" +
                "⦁\tהמפעילה שומרת לעצמה את הזכות לבצע כל שינוי בתוכן או במידע או בשירותים הניתנים באפליקציה, לפי שיקול דעתה הבלעדי וללא מתן הודעה מוקדמת. במסגרת זו המפעילה שומרת לעצמה את הזכות להציע שירותים (נוכחיים או עתידיים) באפליקציה הכרוכים בתשלום, ובמקרה זה שירותים כאמור יהיו כפופים לתנאי השימוש ולהוראות נוספות אשר יצוינו באפליקציה לעניין זה.\n" +
                "3.שימוש באפליקציה\n" +
                "⦁\tהנך מתחייב, כי בכל עת שהנך עושה שימוש באפליקציה, לא תעשה שימוש באפליקציה באופן אחר מאשר הקבוע בתנאי שימוש אלו.\n" +
                "⦁\tכל משרה אשר כל מעסיק ירצה לפרסם באפליקציה תהיה כפופה לאישורה של המפעילה בטרם עלייתה לאפליקציה.\n" +
                "⦁\tכל מעסיק המעוניין למפרסם מודעה באפליקציה ו/או מחפש עבודה העושה שימוש באפליקציה, מתחייב בזאת באופן בלתי מסויג לפעול כדלקמן:\n" +
                "⦁\tלא לכתוב כל הודעה, מידע, נתונים או כל חומר אחר, שאינו חוקי ו/או מפר הסכם או התחייבות או זכות כלשהי ו/או מזיק ו/או מאיים ו/או מטריד ו/או פוגע ו/או גזעני ו/או משמיץ ו/או עלול להוות הוצאת דיבה ו/או לשון הרע ו/או עלול לעלות כדי הפרת פרטיותו של אדם אחר;\n" +
                "⦁\tלא להתחזות לאדם ו/או לכל גורם אחר ובכלל זה לא למלא פרטים שקריים ו/או בלתי מדויקים במהלך ההרשמה לאפליקציה, או בכל זמן אחר בעת ביקור באפליקציה;\n" +
                "⦁\tלא להכניס מידע לאפליקציה העלול לשדל משתמשים אחרים ו/או לקדם מטרה בלתי חוקית ו/או שעלול לגרום לנזק וכן לא לשלוח חומר הכולל וירוס ו/או תוכנת מחשב העלול לגרום נזק לאפליקציה;\n" +
                "⦁\tלא להפר, בין במישרין ובין בעקיפין, בין במתכוון ובין שלא במתכוון, הוראות כל דין;\n" +
                "⦁\tלא לפרסם כל מידע בטחוני רגיש, או מידע אחר אשר מטבעו רגיש ו/או כל חומר בלתי חוקי או חומר המעודד, תומך, מסייע, מספק הוראות לביצוע או מנחה בביצוע מעשה המהווה עבירה פלילית לפי דיני מדינת ישראל;\n" +
                "⦁\tלא לפרסם כל חומר המהווה לשון הרע (הוצאת דיבה) על אדם ו/או כל חומר פורנוגרפי או בעל אופי מיני בוטה, המפר הוראות כל דין או עלול לפגוע ברגשות הציבור ו/או כל חומר הפוגע או מפר זכויות קנייניות של אחרים או מסלף זכויות ו/או תכנים של צדדים שלישיים - לרבות זכויות קניין רוחני כגון זכויות יוצרים או סימני מסחר;\n" +
                "⦁\tלא לפגוע בפרטיותו של אדם אחר, כמפורט בחוק הגנת הפרטיות, תשמ\"א - 1981 לרבות התקנות וההנחיות שנגזרו מכוחו, וכן לא למסור מידע המזהה אישית אנשים אחרים שלא הסכימו לכך במפורש ו/או כל חומר החושף את פרטיו האישיים או האינטימיים של אדם (לרבות שמו), מבלי שהוא עצמו מסר אותו ו/או חומר הפוגע בפרטיותו ו/או בצנעת אישיותו של אדם, וכן לא לאסוף, להוריד או להעתיק רשימות של משתמשים או מידע אחר לגבי משתמשים, ולא להשתמש במידע זה או להעבירו לצד שלישי כלשהו;\n" +
                "⦁\tלא להשתמש באפליקציה ובתכנים שלה באופן העלול להזיק, לשתק, לגרום לעומס יתר, או לפגוע באפליקציה, ברשתות תקשורת ובציוד תקשורת כלשהו, או להפריע לשימוש של גורם אחר כלשהו ולהנאתו מהאפליקציה;\n" +
                "⦁\tלא לנסות לקבל גישה ללא הרשאה לאפליקציה, לתכנים, לחשבונות של משתמשים אחרים או למערכות מחשבים או רשתות המחוברות לאפליקציה בכל דרך שהיא. ויובהר, כי אינך רשאי לאסוף נתונים מהאפליקציה בכל דרך שהיא, לרבות באמצעות דרך אלקטרונית ו/או ממוחשבת ו/או באמצעות תוכנות אוטומטיות.\n" +
                "⦁\tהחברה שומרת לעצמה את הזכות (א) לחסום ו/או להסיר כל משתמש העושה שימוש באפליקציה במידה והינו עושה שימוש באפליקציה בניגוד להוראות תנאי שימוש אלו ו/או מדיניות הפרטיות של האפליקציה ו/או הוראות הדין; ו- (ב) לחסום ו/או להסיר ו/או לבטל כל מודעה שאינה עומדת בהוראות תנאי שימוש אלו ו/או מדיניות הפרטיות של האפליקציה ו/או הוראות הדין ו/או אשר יש בה כדי לפגוע בכל אדם או ישות משפטית אחרת ו/או אשר נסיבות פרסומה קשורות, במישרין או בעקיפין, למעשה של תרמית או לכל מעשה אסור אחר.\n" +
                "⦁\tבמידת הצורך ובמקרים כגון המקרים המפורטים בסעיף 3.3 לעיל (אך לא מוגבל לכך), המפעילה תהיה רשאית לשתף פעולה עם כל רשות של אכיפת חוק או צו של בית משפט אשר יבקשו או יורו למפעילה לגלות את זהותו של מי שהפר סעיף ו/או סעיפים המפורטים בסעיף 3.3 לעיל.\n" +
                "4.זכויות יוצרים וסימני מסחר\n" +
                "⦁\tהתוכן שהמפעילה מעמידה לרשותך באמצעות האפליקציה (\"תוכן\"), לרבות, בין השאר, ולא רק, וידיאו, טקסט, תמונות וגרפיקה, מוגן על ידי חוקי זכויות היוצרים של ישראל ועל ידי אמנות זכויות היוצרים הבינלאומיות, כפוף לזכויות ולחוקים אחרים בעניין קניין רוחני וזכויות קנייניות, והוא בבעלותה הבלעדית של המפעילה ו/או מעניקי הרישיונות שלה והספקים שלה.\n" +
                "⦁\tאינך רשאי להדפיס, להעתיק, לשעתק, להפיץ, להעניק רישיון, לשנות או לשכפל באופן כלשהו את האפליקציה, במלואה או בחלקה, לרבות קוד המקור, התוכן, תוכנה, עיצוב האפליקציה, קבצי האודיו והווידיאו המשולבים באפליקציה, הטקסט שבתוך האפליקציה, ממשק המשתמש (Look and Feel) וכיו\"ב (\"מרכיבי האפליקציה\").\n" +
                "⦁\tהשמות, הלוגואים והחומרים אשר מוצגים באפליקציה מהווים סימני מסחר, שמות מסחריים, סימני שירות או סמלילים (להלן ביחד: \"סימני מסחר\") שבבעלות ו/או ברישיון של המפעילה ו/או חברות קשורות אליה או בבעלות של צדדים שלישיים אשר מפרסמים באפליקציה. הבעלות בכל סימני המסחר והמוניטין הקשורים בהם יישארו בידי המפעילה ו/או החברות הקשורות אליה או בבעלות הצדדים השלישיים המפרסמים באפליקציה או במקרה של סימני מסחר מורשים, בידי מעניק הרישיון.\n" +
                "5.בעלות על האפליקציה\n" +
                "⦁\tאפליקציה זו ניתנת לך לצורך שימוש בהתאם לתנאי השימוש, ואינה נמכרת לך. אין לך זכויות בעלות באפליקציה, במרכיבי האפליקציה ו/או בכל שירותים או תפקודיות שהאפליקציה מספקת (\"שירותים\"). המפעילה שומרת בידיה את כל הזכויות, זכויות הקניין הרוחני והאינטרסים באפליקציה, במרכיבי האפליקציה ובשירותים (לרבות כל שינויים, עדכונים או תיקונים בהם). \n" +
                "6.תאימות \n" +
                "⦁\tהמפעילה אינה יוצרת מצג או מתחייבת, כי האפליקציה תואמת את כל גרסאות החומרה ו/או התוכנה הקיימות במכשיר שלך (לרבות כל גרסה ספציפית של הטלפון שלך, של מחשב טאבלט, המחשב הנייח או הנייד שלך או של מערכת ההפעלה של כל אחד מאלה). תוכל להשיג מידע על תאימות של גרסאות חומרה ותוכנה לכל גרסה של האפליקציה על ידי יצירת קשר עם המפעילה בכתובת אשר מפורטת בסוף תנאי השימוש.\n" +
                "7.עדכונים באפליקציה \n" +
                "⦁\tהמפעילה עשויה לבחור לספק עדכונים לאפליקציה מפעם לפעם על פי שיקול דעתה הבלעדי. במידה שתבחר להעלות עדכונים כאלה לאפליקציה או להשתמש בהם, אזי אתה מאשר כי הגרסה של תנאי שימוש אלו תחייב אותך, כפי שהייתה בתוקף במועד שבו הורדת והשתמשת בעדכונים אלה לאפליקציה.\n" +
                "⦁\tההפצה של האפליקציה על ידי המפעילה באמצעות שירותים של צדדים שלישיים (לדוגמה, חנות האפליקציות של Apple וחנותPlay של Android) עשויה לחייב את המשתמשים להוריד גרסאות עדכון חדשות של האפליקציה על בסיס תקופתי, ואתה מאשר, כי תחייב אותך הגרסה של הסכם הרישיון אשר תחול בזמן שבו תוריד את הגרסה החדשה או המעודכנת של האפליקציה ותשתמש בה.\n" +
                "⦁\tהמפעילה אינה יוצרת מצג או מתחייבת, כי כל עדכון עתידי לאפליקציה יהיה תואם לכל גרסאות החומרה ו/או התוכנה הקיימות במכשיר שלך (לרבות כל גרסה או עדכון בעתיד של הטלפון שלך, מחשב הטאבלט, המחשב הנייח או הנייד שלך או של מערכת ההפעלה של כל אחד מאלה) או יספק פונקציונליות זהה לזו שמספקת הגרסה הנוכחית של האפליקציה שקיימת אצלך.\n" +
                "8.קישורים \n" +
                "⦁\tהאפליקציה עשויה להכיל קישורים לאתרי אינטרנט של צדדים שלישיים (\"אתרים מקושרים\"). האתרים המקושרים אינם נתונים לשליטתה של המפעילה והמפעילה אינה אחראית לזמינות שלהם, לתכנים שלהם או לביצועים של כל אתר מקושר. המפעילה מספקת לך קישורים אלה לנוחיותך בלבד, ואין לפרש את ההכללה של קישור כלשהו כאילו משתמע ממנה אימוץ על ידי המפעילה של האתר המקושר, או של התכנים שלו או של השירותים או המוצרים אשר זמינים באמצעות האתר מקושר זה או כל קשר לפעילותו. אתה אחראי לעיין ולציית להצהרות הפרטיות ולתנאי השימוש המתפרסמים באתרים המקושרים. עליך להפנות כל חשש שיש לך בקשר לאתרים של צדדים שלישיים אלה למנהלים של אותם אתרים.\n" +
                "⦁\tאתה מסכים שלא תחול על המפעילה כל אחריות או חבות לכל מידע, תוכנה או חומרים אשר יימצאו בכל אתר מקושר.\n" +
                "9.תוכן ושירותי האפליקציה\n" +
                "⦁\tהאפליקציה, התוכן והשירותים מסופקים \"כמות שהם\" (\"As Is\"). המפעילה והספקים שלה אינם נותנים מצג או התחייבות כלשהם בקשר לאפליקציה ולשירותים, במפורש או במשתמע, לרבות מצג או התחייבות בנוגע לאיכות מסחרית, אי הפרה, או התאמה לשימוש או למטרה מסוימים.\n" +
                "⦁\tSשלך מכל בחינה שהיא או כי יהיו זמינים בכל זמן, או כי ההפעלה של האפליקציה או של השירותים תתנהל ללא הפרעות וללא שגיאות, או כי שגיאות באפליקציה ו/או במרכיבי האפליקציה ו/או בשירותים או אי התאמה לתיעוד של האפליקציה ו/או של מרכיבי האפליקציה ו/או של השירותים יתוקנו או יהיו ניתנות לתיקון. \n" +
                "10.הגבלת אחריות \n" +
                "⦁\tככל שמותר על פי דין, בשום מקרה המפעילה ו/או ספקיה ו/או מעניקי הרישיונות שלה לא יהיו אחראים לנזקים ישירים, עקיפים, מיוחדים, תוצאתיים, אגביים, או עונשיים מכל סוג שהוא (לרבות, מבלי להגביל, נזקים בשל אובדן רווחים מעסק, הפרעה למהלך העסקים, אובדן של מידע עסקי, או אובדן ממוני אחר) אשר ינבעו מהשימוש שלך באפליקציה ו/או בשירותים, או מחוסר האפשרות שלך להשתמש באפליקציה ו/או בשירותים, או מהשימוש שלך או מההסתמכות שלך על כל נתונים שעשויה להיות לך גישה אליהם בקשר לשימוש באפליקציה ו/או בשירותים, אפילו אם ניתנה הודעה למפעילה או לספקיה על האפשרות שייגרמו נזקים אלה.\n" +
                "⦁\tמשתמש שייעשה שימוש באפליקציה בניגוד לתנאי השימוש ו/או מדיניות הפרטיות ו/או בניגוד להוראות הדין, יישא לבדו באחריות למעשיו, לרבות אחריות בגין כל נזק ישיר ו/או עקיף שייגרם למפעילה. משתמש שייעשה שימוש באפליקציה בניגוד לתנאי השימוש ו/או מדיניות הפרטיות ו/או בניגוד להוראות הדין יהא מחויב לפצות את מפעילה ולשפות אותה ו/או את עובדיה, מנהליה, בעלי מניותיה, או מי מטעמם של אלו על כל נזק ישיר ו/או עקיף לרבות הפסד, אבדן רווח, תשלום או הוצאה שייגרמו להם - ובכלל זה שכ\"ט עו\"ד והוצאות משפט, והכל עם דרישתה הראשונה של מפעילה ועל פיה.\n" +
                "⦁\tהמפעילה תהא רשאית להפסיק את השימוש שכל מעסיק ו/או מחפש עבודה עושה באפליקציה בכל זמן ללא הודעה מראש, אולם אין בהפסקות שימוש שכאלה כדי לפטור אותך מאחריות כאמור לעיל ו/או להוות איסור ו/או הסכמה לפעולתך כאמור.\n" +
                "11.ברירת דין וסמכות שיפוט\n" +
                "⦁\tהתנאים המובאים לעיל ולהלן פרשנותם ואכיפתם נשלטים על ידי חוקי מדינת ישראל בלבד. כל הפעולות המתבצעות באמצעות האפליקציה כפופות לדין הישראלי בלבד וכל הליך משפטי בגין כל עילה שמקורה בפעולה משפטית שהתבצעה באפליקציה יתברר בבית המשפט המוסמך במחוז תל אביב יפו בלבד.\n" +
                "12.כיצד ליצור עמנו קשר \n" +
                "דוא\"ל: support@yad2jobs.co.il\n";
    }

    private String getPrivacyPolicy() {
        return "מדיניות הפרטיות באפליקציה\n" +
                "מבוא\n" +
                "מדיניות הפרטיות המפורטת להלן נועדה להסדיר את כל נושא הפרטיות באפליקציית ג'ובים (\"האפליקציה\").\n" +
                "מדיניות הפרטיות האמורה חלה על כל השירותים המוצעים באפליקציה.\n" +
                "המידע שנאסף\n" +
                "במסגרת השימוש באפליקציה יתבקש מחפש העבודה לספק מספר נתונים אישיים כדוגמת: שם מלא, מספר טלפון, כתובת מייל, יישוב מגורים ועוד (\"מידע\"). בעת מסירת הטלפון הנייד שלך בשימוש הראשוני של האפליקציה הנך מסכים, כי נתונים אלה יועברו ויישמרו אצל נטוויז'ן בע\"מ (או כל חברה אחרת שתחליף אותה כמחזיקת מאגר המידע) (\"המחזיקה\") בעבור ג'וב סיטי בע\"מ (\"המפעילה\" או \"בעלת המאגר\", לפי העניין) בהתאם להוראות חוק הגנת הפרטיות, התשמ\"א - 1981 (\"החוק\"). יודגש, כי מסירת הנתונים הנ\"ל על ידך אינה מחויבת על פי חוק, אולם ללא מסירת הנתונים המוגדרים באפליקציה כ\"חובה\", לא תוכל להשתמש בשירותים המוצעים באפליקציה.\n" +
                "כל משתמש באפליקציה יהיה רשאי לבקש בכתב מהמפעילה, כי מידע המתייחס אליו לא יימסר לצדדים שלישיים.\n" +
                "השימוש במידע\n" +
                "המפעילה ו/או מי מטעמה ו/או המחזיקה מתחייבים בזאת לעשות שימוש במידע בכפוף להוראות כל דין ובהתאם לעקרונות המובאים בתנאי השימוש ובמדיניות הפרטיות.\n" +
                "השימוש במידע שייאסף על ידי המפעילה, ככל שייאסף, יוחד בין היתר לשימושים הבאים:\n" +
                "קבלת/שליחת דואר אלקטרוני ויצירת קשר עמך בדרכים אחרות בכפוף להוראות הדין;\n" +
                "ייתכן וייעשה שימוש כללי במידע שנאסף לצורך שיפור השירותים הניתנים במסגרת האפליקציה, שינוי וייעול מבנה האפליקציה, הרחבת תחומי הפעילות של האפליקציה או צמצומם ומטרות נוספות לפי שיקול דעת המפעילה, וזאת לטובת המשתמשים והגולשים והפעילות של האפליקציה.\n" +
                "העברת המידע לצדדים שלישיים\n" +
                "המפעילה תעביר לצדדים שלישיים את המידע, במקרים המפורטים להלן:\n" +
                "העברת המידע של מחפש העבודה למעסיקים המפרסמים מודעות באפליקציה אשר עימם יצר קשר מחפש העבודה;\n" +
                "העברת מידע של מחפש העבודה למפרסמים שונים ו/או לצדדים שלישיים אחרים, אשר יפעלו מטעם המפעילה;\n" +
                "לצורך אחסון המידע אצל המחזיקה ולצורך עיבודו, בהתאם להוראות שיימסרו מטעם המפעילה ובאופן העולה בקנה אחד עם מדיניות הפרטיות של המפעילה והדין בישראל בגין הגנת פרטיות;\n" +
                "במידה ותפר את תנאי מהתנאים המפורטים בתנאי השימוש ו/או במדיניות הפרטיות באפליקציה ו/או תבצע פעולות המנוגדות לדין ו/או ניסיון לבצע פעולות מנוגדות לדין;\n" +
                "לצורך ציות לדין החל, לתקנה, להליך משפטי או לבקשה ממשלתית הניתנת לאכיפה;\n" +
                "בכל מחלוקת, טענה, תביעה, דרישה או הליכים משפטיים, אם יהיו, בינך לבין המפעילה;\n" +
                "מעורבות המפעילה במיזוג, ברכישה או במכירת נכסים, והכל בכפוף לכך שאותו צד שלישי יקבל על עצמו כלפיך את הוראות מדיניות פרטיות זו.\n" +
                "מבלי לגרוע מן האמור לעיל יובהר, כי מעת מסירת הטלפון הנייד של המחפש העבודה למפעילה, מאשר ומסכים בזאת מחפש העבודה להעברת המידע למפרסמים ו/או לצדדים שלישיים אחרים, ולא תהיה למחפש העבודה טענה ו/או דרישה כלפי המפעילה עקב כך.\n" +
                "אבטחת מידע\n" +
                "בעלת המאגר ו/או המחזיקה מאבטחים את המידע המצוי באפליקציה וברשת מחשביהן ככל שהיא נוגעת להפעלת האפליקציה, במערכות מתקדמות ביותר. על אף המאמצים והמשאבים המושקעים בכך, בעלת המאגר ו/או המחזיקה אינן יכולות להתחייב בפני המשתמשים לכך שלא תתאפשר חדירה לא חוקית למידע הכלול באפליקציה וברשת המחשבים. בהתאם, בעלת המאגר ו/או המחזיקה לא יהיו אחראים לכל חדירה כאמור.\n" +
                "שינויים במדיניות הפרטיות\n" +
                "המפעילה רשאית לשנות מעת לעת את הוראות מדיניות הפרטיות.";
    }
}
